app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Class 19"], ["room_number", 209], ["created_at", "2019-12-17 22:42:56.512970"], ["updated_at", "2019-12-17 22:42:56.512970"]]
---
    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.find_by(id: params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school_class = SchoolClass.find_by(id: params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Another trial class EDITED"], ["room_number", 991], ["updated_at", "2019-12-17 23:59:26.562237"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find_by(id: params[:id])
        @school_class.update(school_class_params)