app/controllers/students_controller.rb

    def create
        @student = Student.new(student_params)
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "asd"], ["last_name", "asd"], ["created_at", "2019-12-17 22:24:24.003846"], ["updated_at", "2019-12-17 22:24:24.003846"]]

    def show
        @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def edit
        @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @student = Student.find_by(id: params[:id])
        @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "john"], ["last_name", "doe"], ["updated_at", "2019-12-17 22:27:40.263773"], ["id", 3]]